# ======================================================================================================================
# Streamlit + LangChain + ChatGPT
# 출처: https://github.com/jaysooo/chatgpt_streamlit_app
# ----------------------------------------------------------------------------------------------------------------------
# 2023.09.07 - 초기모듈 작성
# ======================================================================================================================
from chatgpt_service import load_env, answer_from_chatgpt
from chatgpt_logger import logger
import streamlit as st

# ----------------------------------------------------------------------------------------------------------------------
# 입력된 채팅을 GPT에 전달하고, 응답을 반환한다.
# ----------------------------------------------------------------------------------------------------------------------
def send_callback():
    query = st.session_state['query']
    answer = answer_from_chatgpt(query)
    st.session_state['answer'] = answer


# ----------------------------------------------------------------------------------------------------------------------
# 화면을 초기화한다.
# ----------------------------------------------------------------------------------------------------------------------
def clear_callback():
     st.session_state.clear()


# ----------------------------------------------------------------------------------------------------------------------
# 사용자 채팅화면을 로딩한다.
# ----------------------------------------------------------------------------------------------------------------------
def load_streamlit():
    #st.sidebar.text_input ='test'
    title = st.title = '## Chat GPT Simple Application .. :robot_face:'
    st.sidebar.title('Chat GPT (RAG)')

    st.write(title)
    st.text_input('prompt:keyboard:', key='query')

    col1,col2,col3 = st.columns([1,1,1])
    with col1:
        st.button("send",on_click=send_callback)
    with col3:
        st.button("clear",on_click=clear_callback)
    
    st.text_area('response',key='answer',height=500)


# ----------------------------------------------------------------------------------------------------------------------
# 메인 함수
# ----------------------------------------------------------------------------------------------------------------------
def main():
    logger.info("main application start..")
    load_env()
    load_streamlit()
    #answer_from_chatgpt("지금 시간은?")

if __name__=='__main__':
    main()